In [1]:
import pymysql

In [10]:
con = pymysql.connect(
    user='quant',
    password='*Bmw1752!',
    host='127.0.0.1',
    db='quant',
    charset='utf8'
)

In [4]:
cursor = con.cursor()
query = """
    select * from goods;
"""

cursor.execute(query)
data = cursor.fetchall()
con.close()

display(data)

(('0001', '', '', 1000, 500, datetime.date(2020, 9, 20)),
 ('0002', '', '', 500, 320, datetime.date(2020, 9, 11)),
 ('0003', '', '', 4000, 2800, None),
 ('0004', '', '', 3000, 2800, datetime.date(2020, 9, 20)),
 ('0005', '', '', 6800, 5000, datetime.date(2020, 1, 15)),
 ('0006', '', '', 500, None, datetime.date(2020, 9, 20)),
 ('0007', '', '', 880, 790, datetime.date(2020, 4, 28)),
 ('0008', '', '', 100, None, datetime.date(2020, 11, 11)))

In [12]:
cursor = con.cursor()
query = """
    insert into goods (goods_id, goods_name, goods_classify, sell_price, buy_price, register_date)
    values ('0009', ' ', ' ', 2000, 1500, '2020-12-30');
"""
cursor.execute(query)
con.commit()
con.close()

In [13]:
import pandas as pd
from sqlalchemy import create_engine

In [18]:
connect_query = 'mysql+pymysql://quant:*Bmw1752!@127.0.0.1:3306/quant'

In [16]:
query = """
    select * from goods
"""
goods = pd.read_sql(query, con=engine)
engine.dispose()

goods.head()

  goods_id goods_name goods_classify  sell_price  buy_price register_date
0     0001                                  1000      500.0    2020-09-20
1     0002                                   500      320.0    2020-09-11
2     0003                                  4000     2800.0          None
3     0004                                  3000     2800.0    2020-09-20
4     0005                                  6800     5000.0    2020-01-15

In [17]:
import seaborn as sns

iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

테이블이 자동으로 생성되네...

In [19]:
engine = create_engine(connect_query)
iris.to_sql(name='iris', con = engine, index = False, if_exists = 'replace')
engine.dispose()

In [23]:
from sqlalchemy_utils import create_database

create_database('mysql+pymysql://root:*Bmw1752!@127.0.0.1:3306/exam')

In [24]:
price = pd.DataFrame({
    "날짜": ['2021-01-02', '2021-01-03'],
    "티커": ['000001', '000001'],
    "종가": [1340, 1315],
    "거래량": [1000, 2000]
})
price.head()

           날짜      티커    종가   거래량
0  2021-01-02  000001  1340  1000
1  2021-01-03  000001  1315  2000

In [ ]:
engine = create_engine('mysql+pymysql://root:*Bmw1752!@127.0.0.1:3306/exam')
price.to_sql('price', con=engine, if_exists='append', index=False)
data_sql = pd.read_sql('price', con=engine)
engine.dispose()